%
% 第二讲，误差分析，多项式计算误差演示
%
clear all;
%
% p(x) = (x-2)^2 
%      = x^9-18x^8+144x^7-672x^6+2016x^5-4032x^4+5376x^3-4608x^2+2304x-512
%
a = [1,-18,144,-672,2016,-4032,5376,-4608,2304,-512];
n = 8000;
x = 1.92:0.16/n:2.08;
y = zeros(n+1,1);
for k = 1:n+1
    y(k) = a(1);
    for i = 2:length(a)
        y(k) = x(k)*y(k) + a(i);
    end
end
subplot(1,2,1); plot(x,y,'.'); % axis([1.92,2.08,])

% px = inline('x^9-18*x^8+144*x^7-672*x^6+2016*x^5-4032*x^4+5376*x^3-4608*x^2+2304*x-512','x');
% y2 = zeros(n+1,1);
% for k = 1:n+1
%     y2 = px(x(k));
% end
% subplot(1,2,1); plot(x,y2,'.');

% 直接计算
z = zeros(n+1,1);
for k = 1:n+1
    z(k) = (x(k)-2)^9;
end
subplot(1,2,2); plot(x,z,'.');